# Напишите программу, которая принимает на вход число N и выдает набор произведений чисел от 1 до N.

# Пример:

# - пусть N = 4, тогда [ 1, 2, 6, 24 ] (1, 1*2, 1*2*3, 1*2*3*4)

a = float(input())
b = float(input())
c = float(input())

if a != 0:
    print(a * pow(x, 2) + b * x + c == 0)
